Repository: Thierry46/Mealy
Catalog: src/locale/*/LC_MESSAGES/messages.po
Languages: fr

source: Mealy - Enter keys
fr: Mealy - Entrez les clés

source: Mealy - Cipher / Decipher
fr: Mealy - Chiffrement / Déchiffrement

source: Ready !
fr: Prêt !

source: Enter secret keys
fr: Entrez vos clés secrètes

source: Numeric key :
fr: Clé numérique :

source: With character key (for security)
fr: Avec clé en lettres (pour sécurité)

source: Validate keys
fr: Valider les clé

source: Mealy - Select external key file
fr: Mealy - Choisissez un fichier clé externe

source: Keyboard input :
fr: Entrée au clavier :

source: Wikipedia Fr page :
fr: Page de Wikipedia Fr :

source: Local file :
fr: Fichier local :

source: Text
fr: Texte

source: Cipher
fr: Chiffrement

source: Decipher
fr: Déchiffrement

source: Or type your text in editor below :
fr: Ou tapez votre texte dans l'éditeur ci-dessous

source: Clear
fr: Effacer

source: Insert from :
fr: Insérer depuis :

source: .txt file...
fr: Fichier .txt...

source: .png file...
fr: Fichier .png...

source: Process
fr: Traiter

source: Change Keys
fr: Modifier les clés

source: Type a text in editor
fr: Tapez un texte dans l'éditeur

source: Mealy - Results
fr: Mealy - Résultats

source: Results
fr: Résultats

source: Text processed
fr: Texte traité

source: Save in a file :
fr: Enregistrer dans un fichier :

source: Key must be a positive integer !
fr: La clé numérique doit être un entier positif !

source: Mealy machine started : Ready
fr: Machine de Mealy démarrée : prête

source: Mealy machine not ready !
fr: Machine de Mealy non démarrée !

source: Problem :
fr: Problème :

source: Results saved in file
fr: Résultats enregistré dans le fichier

source: Unable to read text file !
fr: Impossible d'enregistrer le texte dans le fichier

source: Message processed : OK
fr: Message traité : OK

source: Mealy error when processing text :
fr: Erreur lors du traitement du texte par Mealy

source: Problem when processing text !
fr: Problème lors du traitement du texte par Mealy

source: Please enter a text !
fr: Veuillez entrer un texte non vide !

source: Unable to save in file
fr: Inmpossible d'enregistrer dans le fichier

source: Go back...
fr: Retour...

source: Go next...
fr: Suivant...

source: Select a PNG file to hide text in it (read only)
fr: Choisissez un fichier PNG pour y cacher le texte (lecture seulement)

source: Select a filename for saving result
fr: Choisissez un nom de fichier pour sauver le résultat

source: Select a file containing text to insert
fr: Selectionnez un fichier contenant le texte à insérer

source: Text read from
fr: Texte lu depuis

source: Select a file containing additional key
fr: Choisisez un fichier contenant la clé supplémentaire

source: Results not saved !
fr: Résultats non sauvegardés !

source: stepic 0.3 optional module not found : steganography is disailable
fr: Le module optionnel stepic 0.3 n'est pas présent : la steganographie est désactivée
